<script setup lang="ts">
import {ref} from "vue"
import MyEditor from "@/layouts/components/MyEditor/index.vue";
import {useTheme} from "@@/composables/useTheme.ts";
import {useDevice} from "@@/composables/useDevice.ts";
const { activeThemeName } = useTheme()
const { isMobile } = useDevice()
const form=ref({
  delivery:false,
  region:"",
  email:"",
  color1:""
})
const emailList=ref([
  {
    label:"SMTP",
    value:"1"
  },
  {
    label:"Mailgun",
    value:"2"
  },
  {
    label:"Postmark",
    value:"3"
  },
  {
    label:"SES",
    value:"4"
  },
  {
    label:"Resend",
    value:"5"
  },

])
</script>

<template>
  <el-form  label-width="auto">
    <div class="directoryHomepage-main">
      <div class="app-form-top-title-view">
        <div class="app-form-top-title-view-top">
          <svg v-if="activeThemeName=='normal'" width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M10.418 1.66699C10.8781 1.66717 11.251 2.03987 11.251 2.5C11.251 2.96013 10.8781 3.33283 10.418 3.33301H3.75098C3.52086 3.33301 3.33398 3.51988 3.33398 3.75V12.917C3.33416 13.147 3.52096 13.333 3.75098 13.333H16.251C16.481 13.333 16.6678 13.147 16.668 12.917V10C16.668 9.53976 17.0407 9.16699 17.501 9.16699C17.9612 9.16699 18.334 9.53976 18.334 10V12.917C18.3338 14.0675 17.4015 15 16.251 15H10.834V16.667H14.168C14.6281 16.6672 15.001 17.0399 15.001 17.5C15.001 17.9601 14.6281 18.3328 14.168 18.333H5.83398C5.3739 18.3328 5.00098 17.9601 5.00098 17.5C5.00098 17.0399 5.3739 16.6672 5.83398 16.667H9.16797V15H3.75098C2.6005 15 1.66814 14.0675 1.66797 12.917V3.75C1.66797 2.59941 2.60039 1.66699 3.75098 1.66699H10.418ZM15.4473 1.66797C15.4538 1.6682 15.4603 1.66856 15.4668 1.66895C15.5132 1.67165 15.5585 1.67752 15.6025 1.6875C15.6058 1.68825 15.609 1.68964 15.6123 1.69043C15.6578 1.70133 15.7019 1.71538 15.7441 1.7334C15.7504 1.73608 15.7565 1.73935 15.7627 1.74219C15.8294 1.77262 15.8914 1.8113 15.9473 1.85742C15.9676 1.87424 15.9878 1.89208 16.0068 1.91113L18.0898 3.99414C18.4153 4.31958 18.4153 4.84741 18.0898 5.17285C17.7645 5.49787 17.2375 5.49783 16.9121 5.17285L16.251 4.51172V7.5C16.251 7.96013 15.8781 8.33283 15.418 8.33301C14.9577 8.33301 14.584 7.96024 14.584 7.5V4.5127L13.9238 5.17285C13.5985 5.49822 13.0706 5.49809 12.7451 5.17285C12.4197 4.84741 12.4197 4.31958 12.7451 3.99414L14.8281 1.91113L14.8916 1.85352C14.8947 1.85101 14.8983 1.84914 14.9014 1.84668C14.9767 1.78709 15.0621 1.73986 15.1553 1.70898C15.1579 1.70811 15.1604 1.7069 15.1631 1.70605C15.2056 1.69243 15.2497 1.68245 15.2949 1.67578C15.3014 1.67481 15.3079 1.67366 15.3145 1.67285C15.3483 1.66868 15.383 1.66699 15.418 1.66699C15.4278 1.667 15.4375 1.66763 15.4473 1.66797Z" fill="#575179"/>
          </svg>
          <svg v-else width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M10.418 1.66699C10.8781 1.66717 11.251 2.03987 11.251 2.5C11.251 2.96013 10.8781 3.33283 10.418 3.33301H3.75098C3.52086 3.33301 3.33398 3.51988 3.33398 3.75V12.917C3.33416 13.147 3.52096 13.333 3.75098 13.333H16.251C16.481 13.333 16.6678 13.147 16.668 12.917V10C16.668 9.53976 17.0407 9.16699 17.501 9.16699C17.9612 9.16699 18.334 9.53976 18.334 10V12.917C18.3338 14.0675 17.4015 15 16.251 15H10.834V16.667H14.168C14.6281 16.6672 15.001 17.0399 15.001 17.5C15.001 17.9601 14.6281 18.3328 14.168 18.333H5.83398C5.3739 18.3328 5.00098 17.9601 5.00098 17.5C5.00098 17.0399 5.3739 16.6672 5.83398 16.667H9.16797V15H3.75098C2.6005 15 1.66814 14.0675 1.66797 12.917V3.75C1.66797 2.59941 2.60039 1.66699 3.75098 1.66699H10.418ZM15.4473 1.66895C15.4538 1.66917 15.4603 1.66954 15.4668 1.66992C15.5132 1.67263 15.5585 1.67848 15.6025 1.68848C15.6059 1.68923 15.609 1.69061 15.6123 1.69141C15.6578 1.70233 15.7019 1.71632 15.7441 1.73438C15.7504 1.73706 15.7565 1.74032 15.7627 1.74316C15.8293 1.77357 15.8915 1.81139 15.9473 1.85742C15.9676 1.87424 15.9878 1.89208 16.0068 1.91113L18.0898 3.99414C18.4153 4.31958 18.4153 4.84741 18.0898 5.17285C17.7645 5.49787 17.2375 5.49783 16.9121 5.17285L16.251 4.51172V7.5C16.251 7.96013 15.8781 8.33283 15.418 8.33301C14.9577 8.33301 14.584 7.96024 14.584 7.5V4.5127L13.9238 5.17285C13.5985 5.49822 13.0706 5.49809 12.7451 5.17285C12.4197 4.84741 12.4197 4.31958 12.7451 3.99414L14.8281 1.91113L14.8916 1.85352C14.8945 1.85113 14.8984 1.84999 14.9014 1.84766C14.9767 1.78795 15.0621 1.7409 15.1553 1.70996C15.1579 1.70909 15.1604 1.70788 15.1631 1.70703C15.2057 1.69337 15.2497 1.68345 15.2949 1.67676C15.3014 1.67579 15.3079 1.67464 15.3145 1.67383C15.3483 1.66964 15.383 1.66699 15.418 1.66699C15.4278 1.667 15.4375 1.6686 15.4473 1.66895Z" fill="#B7B2DF"/>
          </svg>
          <span>付费提交</span>
        </div>
      </div>
      <div class="app-form-main-padding">
        <el-form-item class="app-form-main-form-item">
          <div class="app-form-main-form-item-box">
            <div class="top">
              <el-switch v-model="form.delivery" />
              <span>启用付费提交</span>
            </div>
            <p class="p1">启用后，用户将可以付费将他们的列表提交到你的目录中。</p>
          </div>
        </el-form-item>
        <el-form-item class="app-form-main-form-item">
          <div class="app-form-main-form-item-box">
            <div class="top">
              <el-switch v-model="form.delivery" />
              <span>需要审核</span>
            </div>
            <p class="p1">启用后，提交内容需经过目录所有者审核后才会显示。</p>
          </div>
        </el-form-item>
      </div>
      <div class="app-form-top-title-view">
        <div class="app-form-top-title-view-top">
          <svg v-if="activeThemeName=='normal'" width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M1.84495 5.73386C2.11199 5.39521 2.58884 5.3195 2.94521 5.54587L3.01519 5.59551L8.58648 9.98597L8.61171 10.0063C8.81043 10.1757 9.05191 10.3342 9.27984 10.3904C9.38312 10.4159 9.46906 10.417 9.54514 10.3994C9.61809 10.3825 9.72159 10.3396 9.85113 10.2203C9.98783 10.0945 10.0297 9.9982 10.0448 9.94366C10.061 9.88516 10.0615 9.8183 10.0416 9.73614C10.0207 9.64997 9.98011 9.55967 9.92926 9.47735C9.90471 9.43762 9.8804 9.4039 9.86008 9.37806C9.85674 9.37381 9.85321 9.37022 9.85032 9.36667L6.5829 6.91631L6.51698 6.86179C6.20652 6.57555 6.15732 6.09528 6.41607 5.75013C6.69218 5.38199 7.21407 5.30728 7.58225 5.5833L10.9156 8.0833L11.0051 8.16062C11.1808 8.33633 11.5221 8.76667 11.6618 9.34388C11.8187 9.99191 11.7027 10.7809 10.9807 11.4459C10.3016 12.0713 9.53778 12.1709 8.88108 12.0091C8.29769 11.8652 7.82979 11.526 7.55458 11.2946V11.2954L1.98329 6.9041L1.919 6.84795C1.61557 6.55432 1.57794 6.07266 1.84495 5.73386Z" fill="#6C658E"/>
            <path d="M11.2507 2.5C11.4579 2.5 11.658 2.57705 11.8114 2.71647L16.3947 6.88314L16.4549 6.94417C16.7369 7.25841 16.741 7.74154 16.4508 8.06071C16.1606 8.38003 15.6788 8.42182 15.3392 8.17057L15.2733 8.11686L10.9284 4.16667H1.66732C1.20708 4.16667 0.833984 3.79357 0.833984 3.33333C0.833984 2.8731 1.20708 2.5 1.66732 2.5H11.2507Z" fill="#575179"/>
            <path d="M18.3335 12.9246L18.4181 12.9287C18.8383 12.9715 19.1661 13.3266 19.166 13.758C19.1658 14.1895 18.8376 14.5449 18.4173 14.5872L18.3319 14.5913L3.74854 14.5832L3.6639 14.5791C3.2436 14.5363 2.91578 14.1806 2.91602 13.749C2.91646 13.2889 3.29004 12.9163 3.75016 12.9165L18.3335 12.9246Z" fill="#575179"/>
            <path d="M18.3327 6.6665C18.7929 6.6665 19.166 7.0396 19.166 7.49984V16.6665C19.166 17.1267 18.7929 17.4998 18.3327 17.4998H3.74935C3.28911 17.4998 2.91602 17.1267 2.91602 16.6665V7.49984C2.91602 7.0396 3.28911 6.6665 3.74935 6.6665C4.20959 6.6665 4.58268 7.0396 4.58268 7.49984V15.8332H17.4993V8.33317H9.16602C8.70582 8.33313 8.33268 7.96005 8.33268 7.49984C8.33268 7.03963 8.70582 6.66655 9.16602 6.6665H18.3327Z" fill="#575179"/>
          </svg>
          <svg v-else width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
            <path d="M1.84495 5.73386C2.11199 5.39521 2.58884 5.3195 2.94521 5.54587L3.01519 5.59551L8.58648 9.98597L8.61171 10.0063C8.81043 10.1757 9.05191 10.3342 9.27984 10.3904C9.38312 10.4159 9.46906 10.417 9.54514 10.3994C9.61809 10.3825 9.72159 10.3396 9.85113 10.2203C9.98783 10.0945 10.0297 9.9982 10.0448 9.94366C10.061 9.88516 10.0615 9.81831 10.0416 9.73614C10.0207 9.64997 9.98011 9.55967 9.92926 9.47735C9.90471 9.43762 9.8804 9.4039 9.86008 9.37806C9.85674 9.37381 9.85322 9.37022 9.85032 9.36667L6.5829 6.91631L6.51698 6.86179C6.20652 6.57555 6.15732 6.09528 6.41607 5.75013C6.69218 5.38199 7.21407 5.30728 7.58225 5.5833L10.9156 8.0833L11.0051 8.16062C11.1808 8.33633 11.5221 8.76667 11.6618 9.34388C11.8187 9.99191 11.7027 10.7809 10.9807 11.4459C10.3016 12.0713 9.53778 12.1709 8.88108 12.0091C8.29769 11.8652 7.82979 11.526 7.55458 11.2946V11.2954L1.98329 6.9041L1.919 6.84795C1.61557 6.55432 1.57794 6.07266 1.84495 5.73386Z" fill="#A39EBD"/>
            <path d="M11.2507 2.5C11.4579 2.5 11.658 2.57705 11.8114 2.71647L16.3947 6.88314L16.4549 6.94417C16.7369 7.25841 16.741 7.74154 16.4508 8.06071C16.1606 8.38003 15.6788 8.42182 15.3392 8.17057L15.2733 8.11686L10.9284 4.16667H1.66732C1.20708 4.16667 0.833984 3.79357 0.833984 3.33333C0.833984 2.8731 1.20708 2.5 1.66732 2.5H11.2507Z" fill="#B7B2DF"/>
            <path d="M18.3335 12.9246L18.4181 12.9287C18.8383 12.9715 19.1661 13.3266 19.166 13.758C19.1658 14.1895 18.8376 14.5449 18.4173 14.5872L18.3319 14.5913L3.74854 14.5832L3.6639 14.5791C3.2436 14.5363 2.91578 14.1806 2.91602 13.749C2.91646 13.2889 3.29004 12.9163 3.75016 12.9165L18.3335 12.9246Z" fill="#B7B2DF"/>
            <path d="M18.3327 6.6665C18.7929 6.6665 19.166 7.0396 19.166 7.49984V16.6665C19.166 17.1267 18.7929 17.4998 18.3327 17.4998H3.74935C3.28911 17.4998 2.91602 17.1267 2.91602 16.6665V7.49984C2.91602 7.0396 3.28911 6.6665 3.74935 6.6665C4.20959 6.6665 4.58268 7.0396 4.58268 7.49984V15.8332H17.4993V8.33317H9.16602C8.70582 8.33313 8.33268 7.96005 8.33268 7.49984C8.33268 7.03963 8.70582 6.66655 9.16602 6.6665H18.3327Z" fill="#B7B2DF"/>
          </svg>

          <span>支付提供商</span>
        </div>
        <p class="app-form-p">选择你要用于付费提交的平台。</p>
      </div>


      <div class="app-form-main-padding app-border-top">
        <el-form-item class="app-form-main-form-item m-b-[16px]">
          <div class="app-form-main-form-item-input-box">
            <p class="title">服务提供商 <span>*</span></p>
            <el-select class="app-form-select" v-model="form.email" popper-class="app-form-select-popper" :class="{'app-form-select-100':isMobile}" placeholder="请选择">
              <el-option v-for="item in emailList" :key="item.value" :label="item.label" :value="item.value"></el-option>
            </el-select>
          </div>
        </el-form-item>


        <div class="app-form-border-view  m-b-[16px]">
          <div class="h-fit flex flex-col gap-[4px] py-[8px] px-[16px]  app-border-top">
            <div class="app-form-title-14" >Lemon Squeezy</div>
            <div class="app-form-p" >连接你的 Lemon Squeezy账户以开始接收付款。</div>
          </div>
          <div class=" p-[16px]">
            <el-form-item class="app-form-main-form-item">
              <div class="app-form-main-form-item-input-box">
                <div class="app-form-row-rule">
                  <p class="title">API Key <span>*</span></p>
                  <div class="app-form-p" > <div class="app-form-p" >连接你的 Lemon Squeezy账户以开始接收付款。</div></div>
                </div>
                <el-input  clearable class="app-form-input app-form-input-width" placeholder="请输入"></el-input>
                <p class="app-form-p">在您的Lemon Squeezy账户中创建新的API密钥。您可以创建它。</p>
              </div>
            </el-form-item>

            <el-form-item class="app-form-main-form-item">
              <div class="app-form-main-form-item-input-box">
                <div class="app-form-row-rule">
                  <p class="title">Store ID<span>*</span></p>
                </div>
                <el-input  clearable class="app-form-input app-form-input-width" placeholder="请输入"></el-input>
                <p class="app-form-p">您的LemonSqueezy账户的商店ID。</p>
              </div>
            </el-form-item>
            <el-form-item class="app-form-main-form-item">
              <div class="app-form-main-form-item-input-box">
                <div class="app-form-row-rule">
                  <p class="title">Webhook Secret<span>*</span></p>
                </div>
                <el-input  clearable class="app-form-input app-form-input-width" placeholder="请输入"></el-input>
                <p class="app-form-p">您的LemonSqueezy webhook 的 webhook密钥。添加任意随机字符串或生成一个。</p>
              </div>
            </el-form-item>
            <el-form-item class="app-form-main-form-item">
              <div class="app-form-main-form-item-input-box">
                <div class="app-form-row-rule">
                  <p class="title">Webhook URL</p>
                </div>
                <el-input  clearable class="app-form-input app-form-input-width" placeholder="请输入"></el-input>
                <p class="app-form-p">请确保将此URL添加到您的Lemon Squeezy网络钩子设置中，并选择所有订单和订阅事件。</p>
              </div>
            </el-form-item>
          </div>
        </div>
      </div>



      <div class="py-[16px] px-[24px] m-t-[16px] border-t border-[var(--app-border-color)] border-t-[0.5px]">
        <el-button class="app-form-submit-botton" :class="{'app-form-submit-botton-width-100':isMobile}">
          <img src="@@/assets/images/adminPages/sub.png" alt="">
          <div class="text">保存</div>
        </el-button>
      </div>
    </div>
  </el-form>

</template>

<style scoped lang="scss">
.directoryHomepage-main{

}

.a{
  display: flex;
  flex-direction: column;
  gap: 4px;
  padding:16px;
  padding-bottom:0;

}


</style>